GrepAndMore.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-03-29 Wed 20:33 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>The Power of grep, sed, and awk</title>
<meta name="author" content="Paige Roy" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">The Power of grep, sed, and awk</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgb66411b">1. grep</a></li>
<li><a href="#org273be1e">2. sed</a>
<ul>
<li><a href="#org94cea1e">2.1. substitution</a></li>
<li><a href="#org082250e">2.2. search</a></li>
<li><a href="#org0889476">2.3. talking about my command</a>
<ul>
<li><a href="#orgb3606aa">2.3.1. 's/^.*://'</a></li>
<li><a href="#org145fc4e">2.3.2. 's/ //g'</a></li>
<li><a href="#org1d2e730">2.3.3. 's/..$//</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<p>
When you are dealing with large quantities of data, or are searching for
a pattern or sentence, grep is here for you. When processing large quantities
of data and making it make just a bit more sense, sed and awk are here.
</p>
<div id="outline-container-orgb66411b" class="outline-2">
<h2 id="orgb66411b"><span class="section-number-2">1.</span> grep</h2>
<div class="outline-text-2" id="text-1">
<p>
GNU grep is a great little program I genuinely use every single day.
Using grep on a piped command you can parse the data for a specific
key word, or phrase which you need. one I use to figure out the name
of a file is 'ls | grep [keyword]'. To make the search non-case sensitive
pass the -i flag. Notice how it count part of a word as a whole keyword?
If you just want the bare word itself you can pass the -w flag.
To search recursively you use the command 'grep -ri [keyword] [directory]'.
To search within a file use 'grep [keyword] [file]'. If you need the number
of a phases occurance, pass the -c flag. To see which files contain the
keyword in a directory say, you can pass the -l flag. There is, quite
a bit more grep can do, and I would reccomend reading the manpage for
grep, or looking up online some more use cases for grep.
</p>
</div>
</div>
<div id="outline-container-org273be1e" class="outline-2">
<h2 id="org273be1e"><span class="section-number-2">2.</span> sed</h2>
<div class="outline-text-2" id="text-2">
<p>
GNU sed is one of those commands which, I figured out a year ago, wrote
some shell scripts using it and then promptly forgot how the heck I wrote
some of my code. One line of code in a shell script I wrote is
'cat <i>proc/meminfo | grep "MemAvailable" | sed -e 's/^.*:/</i>' -e 's/ <i>/g' -e 's</i>..$//'
and oh my god this is literally hideous. Sed is a stream editor, and can
edit a stream of input that is provided to it. What I was doing here
was formatting the output from the /proc/meminfo file into something more
readable for my status bar.
</p>
</div>
<div id="outline-container-org94cea1e" class="outline-3">
<h3 id="org94cea1e"><span class="section-number-3">2.1.</span> substitution</h3>
<div class="outline-text-3" id="text-2-1">
<p>
sed can be used to search out a string, and replace it with another.
To do so, the sed command is 's/[find]/[replace]/' &lt;[old] &gt;[new].
If you want to edit the original file, pass the -i flag as well.
But this only replaces the first instance of this [find] term in
the stream. To make it affect all of the instances of this you can
add the g term after the last slash which makes it have the substitution
affect all terms in the input. You can specify other things after
the final / term, such as i which signifies case insensitivity. The
/'s are called sigals, and can actually be replaced with a different
term. For instance some people use @ or [. To delete a whole line
with the specified string in them use the command '/[string]/d'.
To chain multiple sed commands you can use the -e command to execute
multiple sed commands back to back. An example command, is
'ls | sed '/~$/d'' what this does here is it deletes any files from
the prompt which have a tilda at the end of them.
</p>
</div>
</div>
<div id="outline-container-org082250e" class="outline-3">
<h3 id="org082250e"><span class="section-number-3">2.2.</span> search</h3>
<div class="outline-text-3" id="text-2-2">
<p>
If you pass the -n flag and '/[keyword]/p'
</p>
</div>
</div>
<div id="outline-container-org0889476" class="outline-3">
<h3 id="org0889476"><span class="section-number-3">2.3.</span> talking about my command</h3>
<div class="outline-text-3" id="text-2-3">
<p>
cat <i>proc/meminfo | grep "MemAvailable" | sed -e 's/^.*:/</i>' -e 's/ <i>/g' -e 's</i>..$//
The previous command I mentioned is not the best piece of sed code
ever written but it gets the point accross. It contains some special
bits and bobs which took me a minute to figure out.
</p>
</div>
<div id="outline-container-orgb3606aa" class="outline-4">
<h4 id="orgb3606aa"><span class="section-number-4">2.3.1.</span> 's/^.*://'</h4>
<div class="outline-text-4" id="text-2-3-1">
<p>
This command removes everything in the line up until the first colon.
</p>
</div>
</div>
<div id="outline-container-org145fc4e" class="outline-4">
<h4 id="org145fc4e"><span class="section-number-4">2.3.2.</span> 's/ //g'</h4>
<div class="outline-text-4" id="text-2-3-2">
<p>
This command removes every space within the line
</p>
</div>
</div>
<div id="outline-container-org1d2e730" class="outline-4">
<h4 id="org1d2e730"><span class="section-number-4">2.3.3.</span> 's/..$//</h4>
<div class="outline-text-4" id="text-2-3-3">
<p>
This command is funky
</p>
<ul class="org-ul">
<li>The .. denotes how many characters we are removing from the end
of the line</li>
<li>The $ denotes that we are starting our work from the end of the
line</li>
</ul>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Paige Roy</p>
<p class="date">Created: 2023-03-29 Wed 20:33</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
